; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	image2 - mode
	thermograph0 - mode
	spectrograph4 - mode
	image1 - mode
	infrared3 - mode
	Star4 - direction
	GroundStation7 - direction
	GroundStation10 - direction
	Star2 - direction
	Star5 - direction
	GroundStation6 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star9 - direction
	Star11 - direction
	Star8 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet17)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet18)
	(supports instrument2 image2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star8)
	(calibration_target instrument4 Star11)
	(calibration_target instrument4 Star9)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star9)
)
(:goal (and
	(pointing satellite2 Phenomenon15)
	(pointing satellite4 Star5)
	(have_image Star12 image1)
	(have_image Phenomenon13 image2)
	(have_image Star14 image1)
	(have_image Phenomenon15 thermograph0)
	(have_image Star16 image2)
	(have_image Planet17 image2)
	(have_image Planet18 image1)
))

)

; plan
1. (turn_to satellite2 groundstation3 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 9
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite2 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite2 planet17 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet17)
   goals met: 0 of 9
5. (take_image satellite2 planet17 instrument2 image2)
   added: (have_image planet17 image2)
   goals met: 1 of 9
6. (turn_to satellite2 phenomenon13 planet17)
   deleted: (pointing satellite2 planet17)
   added: (pointing satellite2 phenomenon13)
   goals met: 1 of 9
7. (take_image satellite2 phenomenon13 instrument2 image2)
   added: (have_image phenomenon13 image2)
   goals met: 2 of 9
8. (switch_on instrument4 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument4)
   goals met: 2 of 9
9. (calibrate satellite4 instrument4 star9)
   added: (calibrated instrument4)
   goals met: 2 of 9
10. (turn_to satellite2 planet18 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 planet18)
   goals met: 2 of 9
11. (take_image satellite2 planet18 instrument2 image1)
   added: (have_image planet18 image1)
   goals met: 3 of 9
12. (turn_to satellite2 star12 planet18)
   deleted: (pointing satellite2 planet18)
   added: (pointing satellite2 star12)
   goals met: 3 of 9
13. (take_image satellite2 star12 instrument2 image1)
   added: (have_image star12 image1)
   goals met: 4 of 9
14. (turn_to satellite2 star14 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star14)
   goals met: 4 of 9
15. (take_image satellite2 star14 instrument2 image1)
   added: (have_image star14 image1)
   goals met: 5 of 9
16. (turn_to satellite2 star16 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star16)
   goals met: 5 of 9
17. (take_image satellite2 star16 instrument2 image2)
   added: (have_image star16 image2)
   goals met: 6 of 9
18. (turn_to satellite2 phenomenon15 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 phenomenon15)
   goals met: 7 of 9
19. (turn_to satellite4 phenomenon15 star9)
   deleted: (pointing satellite4 star9)
   added: (pointing satellite4 phenomenon15)
   goals met: 7 of 9
20. (take_image satellite4 phenomenon15 instrument4 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 8 of 9
21. (turn_to satellite4 star5 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 star5)
   goals met: 9 of 9
